---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.ShowSlotFromDeviceInsteadOfTemplate
source: html/c5ea28f4-3388-5e21-54a7-750f6a433aa0.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.ShowSlotFromDeviceInsteadOfTemplate Property

When true, the number of rows in an instance will be the number of poles on the associated device, not a set number

## Syntax (C#)
```csharp
public bool ShowSlotFromDeviceInsteadOfTemplate { get; set; }
```